# Taps
tap 'homebrew/cask'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'mongodb/brew'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'grep'
brew 'mackup'

# Development
brew 'mongodb-community'
brew 'node'
brew 'nvm'
brew 'yarn'

# Apps
cask '1password'
cask 'alfred'
cask 'arc'
cask 'docker'
cask 'dropbox'
cask 'google-drive'
cask 'microsoft-office'
cask 'mimestream'
cask 'mongodb-compass'
cask 'notion'
cask 'postman'
cask 'rectangle'
cask 'slack'
cask 'spotify'
cask 'sublime-text'
cask 'tableplus'
cask 'thefuck'
cask 'visual-studio-code'
cask 'vlc'
