# Taps
tap 'homebrew/services'
tap 'mongodb/brew'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'grep'
brew 'mackup'

# Development
brew 'mongodb-community'
brew 'node'
brew 'nvm'
brew 'postrgresql'
brew 'yarn'

# Apps
cask '1password'
cask 'amie'
cask 'arc'
cask 'beardedspice'
cask 'docker'
cask 'google-drive'
cask 'herd'
cask 'iterm2'
cask 'microsoft-office'
cask 'mimestream'
cask 'mongodb-compass'
cask 'monitorcontrol'
cask 'notion'
cask 'openvpn-connect'
cask 'phpstorm'
cask 'postman'
cask 'raycast'
cask 'slack'
cask 'spotify'
cask 'sublime-text'
cask 'tableplus'
cask 'thefuck'
cask 'tower'
cask 'vlc'
